//********************************************************************
//
//      KEY Init Initialization Part
//      4DClass
//      Copyright(C)  2017
//      All rights reserved
//***********************************************************************
#include "MyInclude.h"

/*******************************************************************************
 * 函数名：isKeyPressed
 * 描述  ：判断学习按键状态
 * 输入  ：无
 * 输出  ：无
 * 调用  ：内部调用
 ******************************************************************************/
uint8_t isKeyPressed(void)  //判断学习按键状态
{
    return  KEY_STUDY ? 0:1;
}
/*******************************************************************************
 * 函数名：KEY_Scan
 * 描述  ：按判断拨码开关状态
 * 输入  ：无
 * 输出  ：无
 * 调用  ：内部调用
 ******************************************************************************/
/*uint8_t isSwitchOn(void)  //判断拨码开关状态
{
    return  DialSwitch ? 1:0;
}*/
